PGM     PARM(&NOMEFILE)
DCL     VAR(&NOMEFILE)    TYPE(*CHAR) LEN(60)
DCL     VAR(&NULL)        TYPE(*CHAR) LEN(1)   VALUE(X'00')
DCL     VAR(&MODE)        TYPE(*CHAR) LEN(11)  VALUE('rb')
DCL VAR(&FILE_BUF_P)  TYPE(*PTR) 
INCLUDE SRCSTMF('FILE_P.CLLE')
CHGVAR  VAR(&NOMEFILE)  VALUE(&NOMEFILE *TCAT &NULL)
CHGVAR  VAR(&MODE)      VALUE(&MODE *TCAT &NULL)
CALLPRC PRC('fopen') PARM(&NOMEFILE &MODE) RTNVAL(&FILE_BUF_P)
DMPCLPGM
CALLPRC PRC('fclose') PARM((&FILE_BUF_P *BYVAL))
ENDPGM
