PGM      PARM(&NOMEFILE)
DCL       VAR(&NOMEFILE) TYPE(*CHAR) LEN(30)
CHGVAR    VAR(&NOMEFILE) VALUE(%TRIM(&NOMEFILE))
SNDPGMMSG MSG(&NOMEFILE)
DMPCLPGM
ENDPGM