PGM    
DCL     VAR(&CURPATH)     TYPE(*CHAR) LEN(512)
DCL     VAR(&SIZE)        TYPE(*INT)  LEN(4)   VALUE(512)
DCL     VAR(&PTR)         TYPE(*PTR)  ADDRESS(*NULL)
CALLPRC PRC('getcwd')   +
        PARM(&CURPATH (&SIZE *BYVAL)) +
        RTNVAL(&PTR)
SNDPGMMSG MSG(&CURPATH)
ENDPGM
