PGM      PARM(&NOMEFILE)
DCL       VAR(&NOMEFILE) TYPE(*CHAR) LEN(30)
DCL       VAR(&NULL)     TYPE(*CHAR) LEN(1)  VALUE(X'00')
CHGVAR    VAR(&NOMEFILE) VALUE(&NOMEFILE *TCAT &NULL)
SNDPGMMSG MSG(&NOMEFILE)
DMPCLPGM
ENDPGM
