PGM       PARM(&NOMEFILE)
DCL        VAR(&NOMEFILE) TYPE(*CHAR) LEN(30)
DCL    VAR(&NULL)         TYPE(*CHAR) LEN(1)   VALUE(X'00')
DCL    VAR(&BUFFER)       TYPE(*CHAR) LEN(128)
CHGVAR     VAR(&NOMEFILE) VALUE(&NOMEFILE *TCAT &NULL)
SNDPGMMSG  MSG(&NOMEFILE)
CALLPRC PRC('stat') PARM(&NOMEFILE &BUFFER)
DMPCLPGM
ENDPGM