DCL VAR(&RIOFB)      TYPE(*CHAR) LEN(64)  STG(*BASED)   BASPTR(&RIOFB_P)
DCL VAR(&R01_KEY)    TYPE(*PTR)           STG(*DEFINED) DEFVAR(&RIOFB  1) 
DCL VAR(&R02_SYSPAR) TYPE(*PTR)           STG(*DEFINED) DEFVAR(&RIOFB 17) 
DCL VAR(&R03_RRN)    TYPE(*UINT) LEN(4)   STG(*DEFINED) DEFVAR(&RIOFB 33) 
DCL VAR(&R04_NUMBYT) TYPE(*INT)  LEN(4)   STG(*DEFINED) DEFVAR(&RIOFB 37) 
DCL VAR(&R05_BLKCNT) TYPE(*INT)  LEN(2)   STG(*DEFINED) DEFVAR(&RIOFB 41) 
DCL VAR(&R06_FILLBY) TYPE(*CHAR) LEN(1)   STG(*DEFINED) DEFVAR(&RIOFB 43) 
DCL VAR(&R07_FLAGS)  TYPE(*CHAR) LEN(1)   STG(*DEFINED) DEFVAR(&RIOFB 44) 
